


import React, { useState } from 'react';
import { Header } from "../header";
import { Leftside } from "../../global";
import { Footer } from "../../global";
import biokvaraphoto from '../../images/bio_kvara_photo.png'



const ReadMore = ({ children }) => {
  const text = children;
  const [isReadMore, setIsReadMore] = useState(true);
  const toggleReadMore = () => {
    setIsReadMore(!isReadMore);
  };
  return (
    <p className="bioText">
    {isReadMore ? text.slice(0, 450) : text}
    <span onClick={toggleReadMore} className="read-or-hide">
      {isReadMore ? "...read more" : " show less"}
    </span>
    </p>
  );
  };
  export const Biography = () => {
    return (
 
    <div className="container">
      <Leftside/>
      <div className="right-1">
      <div className="right-001"></div>
        <Header/>
        <div className="right-2">
          <div className="right-3">   
            <div className="bio_info_cont">

              <div className="bio_in">
                <div className="bio_left">
                  <ul className="bio_list">
                    <li className="bio_list_item">
                      დაბადების თარიღი
                      <span className="bio_item_span">12 თებერვალი, 2001</span>
                    </li>
                    <li className="bio_list_item">
                      დაბადების ადგილი
                      <span className="bio_item_span">საქართველო, თბილისი</span>
                    </li>
                    <li className="bio_list_item">
                      სიმაღლე
                      <span className="bio_item_span">181სმ</span>
                    </li>
                    <li className="bio_list_item">
                      წონა
                      <span className="bio_item_span">70 კგ</span>
                    </li>
                    <li className="bio_list_item">
                      პოზიცია
                      <span className="bio_item_span">შემტევი ნახევარმცველი</span>
                    </li>
                  </ul>
                </div>
                <div className="bio_right">
                  <div className="bio_photo_cont">
                    <img src={biokvaraphoto} alt="" className="bio_photo" />
                  </div>
                </div>
              </div>
                <div  className="break_line"></div>
              <div className="info-1">
              <div className="info-2">ბიოგრაფია</div> 
              <ReadMore>
              ხვიჩა კვარაცხელია (დ. 12 თებერვალი, 2001, თბილისი, საქართველო) 
               ქართველი ფეხბურთელი. საქართველოს ეროვნული ნაკრებისა და საფეხბურთო კლუბ „ნაპოლის“ შემტევი ნახევარმცველი.

               ადრეული კარიერა 2012 წლიდან თამაშობდა თბილისის „დინამოს“ აკადემიასა და ახალგაზრდულ გუნდებში. 
               კვარაცხელიამ საკლუბო კარიერა 2017 წელს, თბილისის „დინამოში“ დაიწყო. 
               კლუბის ძირითად შემადგენლობაში მისი დებიუტი იმავე წლის 29 სექტემბერს კოლხეთი-1913-ის წინააღმდეგ გამართულ 
               საქართველოს ჩემპიონატის შეხვედრაში შედგა. დინამოელთა მაისურით მან მხოლოდ ოთხი მატჩი ითამაშა და ერთი გოლი შეაგდო. 
               მომდევნო წელს „რუსთავში“ გადავიდა, რომლის მაისურითაც 18 შეხვედრა ჩაატარა და სამი ბურთი გაიტანა.

               ადრეული კარიერა 2012 წლიდან თამაშობდა თბილისის „დინამოს“ აკადემიასა და ახალგაზრდულ გუნდებში. 
               კვარაცხელიამ საკლუბო კარიერა 2017 წელს, თბილისის „დინამოში“ დაიწყო. 
               კლუბის ძირითად შემადგენლობაში მისი დებიუტი იმავე წლის 29 სექტემბერს კოლხეთი-1913-ის წინააღმდეგ გამართულ 
               საქართველოს ჩემპიონატის შეხვედრაში შედგა. დინამოელთა მაისურით მან მხოლოდ ოთხი მატჩი ითამაშა და ერთი გოლი შეაგდო. 
               მომდევნო წელს „რუსთავში“ გადავიდა, რომლის მაისურითაც 18 შეხვედრა ჩაატარა და სამი ბურთი გაიტანა.

               ადრეული კარიერა 2012 წლიდან თამაშობდა თბილისის „დინამოს“ აკადემიასა და ახალგაზრდულ გუნდებში. 
               კვარაცხელიამ საკლუბო კარიერა 2017 წელს, თბილისის „დინამოში“ დაიწყო. 
               კლუბის ძირითად შემადგენლობაში მისი დებიუტი იმავე წლის 29 სექტემბერს კოლხეთი-1913-ის წინააღმდეგ გამართულ 
               საქართველოს ჩემპიონატის შეხვედრაში შედგა. დინამოელთა მაისურით მან მხოლოდ ოთხი მატჩი ითამაშა და ერთი გოლი შეაგდო. 
               მომდევნო წელს „რუსთავში“ გადავიდა, რომლის მაისურითაც 18 შეხვედრა ჩაატარა და სამი ბურთი გაიტანა.

               ადრეული კარიერა 2012 წლიდან თამაშობდა თბილისის „დინამოს“ აკადემიასა და ახალგაზრდულ გუნდებში. 
               კვარაცხელიამ საკლუბო კარიერა 2017 წელს, თბილისის „დინამოში“ დაიწყო. 
               კლუბის ძირითად შემადგენლობაში მისი დებიუტი იმავე წლის 29 სექტემბერს კოლხეთი-1913-ის წინააღმდეგ გამართულ 
               საქართველოს ჩემპიონატის შეხვედრაში შედგა. დინამოელთა მაისურით მან მხოლოდ ოთხი მატჩი ითამაშა და ერთი გოლი შეაგდო. 
               მომდევნო წელს „რუსთავში“ გადავიდა, რომლის მაისურითაც 18 შეხვედრა ჩაატარა და სამი ბურთი გაიტანა.

               ადრეული კარიერა 2012 წლიდან თამაშობდა თბილისის „დინამოს“ აკადემიასა და ახალგაზრდულ გუნდებში. 
               კვარაცხელიამ საკლუბო კარიერა 2017 წელს, თბილისის „დინამოში“ დაიწყო. 
               კლუბის ძირითად შემადგენლობაში მისი დებიუტი იმავე წლის 29 სექტემბერს კოლხეთი-1913-ის წინააღმდეგ გამართულ 
               საქართველოს ჩემპიონატის შეხვედრაში შედგა. დინამოელთა მაისურით მან მხოლოდ ოთხი მატჩი ითამაშა და ერთი გოლი შეაგდო. 
               მომდევნო წელს „რუსთავში“ გადავიდა, რომლის მაისურითაც 18 შეხვედრა ჩაატარა და სამი ბურთი გაიტანა.

               ადრეული კარიერა 2012 წლიდან თამაშობდა თბილისის „დინამოს“ აკადემიასა და ახალგაზრდულ გუნდებში. 
               კვარაცხელიამ საკლუბო კარიერა 2017 წელს, თბილისის „დინამოში“ დაიწყო. 
               კლუბის ძირითად შემადგენლობაში მისი დებიუტი იმავე წლის 29 სექტემბერს კოლხეთი-1913-ის წინააღმდეგ გამართულ 
               საქართველოს ჩემპიონატის შეხვედრაში შედგა. დინამოელთა მაისურით მან მხოლოდ ოთხი მატჩი ითამაშა და ერთი გოლი შეაგდო. 
               მომდევნო წელს „რუსთავში“ გადავიდა, რომლის მაისურითაც 18 შეხვედრა ჩაატარა და სამი ბურთი გაიტანა.





		          </ReadMore>
             
            </div>

            </div>

            
          </div>
        </div>
        
      </div>
      <Footer/>
    </div>
  );
};








